{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "batch_input_shape": [null, 16, 32, 1], "name": "lambda_1", "trainable": true, "output_shape_type": "raw", "arguments": {}, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>e\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 3, "name": "convolution2d_1", "border_mode": "valid", "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "input_dtype": "float32", "b_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 16, 32, 1], "subsample": [1, 1], "nb_col": 3, "trainable": true, "nb_filter": 2, "W_constraint": null, "bias": true, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [4, 4], "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "strides": [4, 4], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "b_constraint": null, "output_dim": 1, "trainable": true, "bias": true, "input_dim": 42, "W_constraint": null}}]}